src/cf/InformationRegisters/СостоянияЗанятостиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияЗанятостиСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СостояниеЗагруженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеЗагруженности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/КартаЗнаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КартаЗнаний</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Верно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КартаЗнаний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КартаЗнанийСпециалиста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вопрос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вопросы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УровеньВладения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровеньВладения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СостояниеРаботыОбращения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостояниеРаботыОбращения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарегистрировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УАналитика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УРазработчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УточнениеИнформации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ПриоритетОбращения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПриоритетОбращения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Высокий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипОбращения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипОбращения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Инцидент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОбслуживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаИзменение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СостояниеЗагруженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостояниеЗагруженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Простой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОтвета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/Обращение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Обращение</Name>
			<BasedOn>
				<xr:Item>Document.ЭлектронноеПисьмоВходящее</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияЗанятостиСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоОтЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбращения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>900</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриоритетОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОбращения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеРаботыОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийИсполнителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайнийСрокРеакции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>КонтактныеЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Клиенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/OTUS/Ext/Module.bsl
Процедура АвтоРегистрацияОбращенияПриЗаписи(Источник, Отказ) Экспорт
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЭлектронноеПисьмоВходящее") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		 |	Обращение.Ссылка КАК Ссылка
		 |ИЗ
		 |	Документ.Обращение КАК Обращение
		 |ГДЕ
		 |	Обращение.ЭлектронноеПисьмо = &ЭлектронноеПисьмо";
		Запрос.УстановитьПараметр("ЭлектронноеПисьмо",Источник.Ссылка);
		Рез = Запрос.Выполнить();
		
		//Если Рез.Пустой() Тогда
			
			ДокОбр = Документы.Обращение.СоздатьДокумент();   
			ДокОбр.Дата = Источник.Ссылка.Дата;
	        ДокОбр.СостояниеОбращения = Перечисления.СостояниеРаботыОбращения.Зарегистрировано;
			ДокОбр.ТемаОбращения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка,"Тема");
			ДокОбр.ОписаниеОбращения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка,"Текст"); 
			ДокОбр.Организация = Константы.Организация.Получить();
			УчетнаяЗапись = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка,"УчетнаяЗапись"); 
			АдресЭлектроннойПочты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись,"АдресЭлектроннойПочты"); 
			
			ДокОбр.СостояниеОбращения = Перечисления.СостояниеРаботыОбращения.Зарегистрировано;
		    ДокОбр.ЭлектронноеПисьмо = Источник.Ссылка;                               
			ДокОбр.Приоритет = Перечисления.ПриоритетОбращения.Обычный;
			ДокОбр.ТипОбращения = Перечисления.ТипОбращения.ЗапросНаОбслуживание;
			Если ЗначениеЗаполнено(Источник.Ссылка.ОтправительАдрес) ТОгда
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	КонтактныеЛицаКонтактнаяИнформация.Ссылка КАК КонтактноеЛицо,
					|	КонтактныеЛицаКонтактнаяИнформация.Ссылка.Владелец КАК Клиент
					|ИЗ
					|	Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
					|ГДЕ
					|	КонтактныеЛицаКонтактнаяИнформация.АдресЭП = &АдресЭП
					|	И КонтактныеЛицаКонтактнаяИнформация.Вид = &Вид";
				
				Запрос.УстановитьПараметр("АдресЭП", НРег(Источник.Ссылка.ОтправительАдрес));
				Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица);			
				РезультатЗапроса = Запрос.Выполнить();			
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();			
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Клиент =  ВыборкаДетальныеЗаписи.Клиент; 
					КонтактноеЛицоОтЗаказчика = ВыборкаДетальныеЗаписи.КонтактноеЛицо;   
					ДокОбр.Клиент = Клиент;
					ДокОбр.КонтактноеЛицоОтЗаказчика = КонтактноеЛицоОтЗаказчика;
				КонецЦикла;	
			КонецЕсли;	
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	КлиентыПараметрыРеакции.ТипОбращения КАК ТипОбращения,
				|	КлиентыПараметрыРеакции.ВремяРеакции КАК ВремяРеакции
				|ИЗ
				|	Справочник.Клиенты.ПараметрыРеакции КАК КлиентыПараметрыРеакции
				|ГДЕ
				|	КлиентыПараметрыРеакции.Ссылка = &Клиент
				|	И КлиентыПараметрыРеакции.ТипОбращения = &ТипОбращения";
			
			Запрос.УстановитьПараметр("Клиент", Клиент);
			Запрос.УстановитьПараметр("ТипОбращения", Перечисления.ТипОбращения.ЗапросНаОбслуживание);

			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				КрайнийСрокРеакции = ТекущаяДата() + ВыборкаДетальныеЗаписи.ВремяРеакции * 60*60;
			КонецЦикла;
			ДокОбр.КрайнийСрокРеакции = КрайнийСрокРеакции; 
			
			МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ДокОбр.ТемаОбращения,";");
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	СистемыУчета.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.СистемыУчета КАК СистемыУчета
				|ГДЕ
				|	СистемыУчета.Наименование ПОДОБНО &Наименование";

			
			Запрос.УстановитьПараметр("Наименование", "%"+МассивСтрок[0]+"%");

			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			ИТСистема = Справочники.СистемыУчета.ПустаяСсылка();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				// Вставить обработку выборки ВыборкаДетальныеЗаписи
				ИТСистема = ВыборкаДетальныеЗаписи.Ссылка;
			КонецЦикла;
		
			ДокОбр.Ответственный = ОпределитьОтветсвенногоПоУмолчанию(Клиент, ИТСистема); 
		
			ДокОбр.Записать();
			
			//Отправка в kafka
			kafka_send(ДокОбр.Ссылка);
			
		//КонецЕсли;			
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьОтветсвенногоПоУмолчанию(Клиент, ИТСистема) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СотрудникиКомпетенцииСотрудника.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ Сотрудники
	               |ИЗ
	               |	Справочник.Сотрудники.КомпетенцииСотрудника КАК СотрудникиКомпетенцииСотрудника
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СостоянияЗанятостиСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	               |	СостоянияЗанятостиСотрудниковСрезПоследних.СостояниеЗагруженности КАК СостояниеЗагруженности
	               |ПОМЕСТИТЬ СостояниеСотрудников
	               |ИЗ
	               |	РегистрСведений.СостоянияЗанятостиСотрудников.СрезПоследних(, ) КАК СостоянияЗанятостиСотрудниковСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Сотрудники.Ссылка КАК Ссылка,
	               |	СостояниеСотрудников.СостояниеЗагруженности КАК СостояниеЗагруженности
	               |ПОМЕСТИТЬ ВТПростои
	               |ИЗ
	               |	Сотрудники КАК Сотрудники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеСотрудников КАК СостояниеСотрудников
	               |		ПО Сотрудники.Ссылка = СостояниеСотрудников.Сотрудник
	               |ГДЕ
	               |	СостояниеСотрудников.СостояниеЗагруженности В(&СостояниеЗагруженностиПростой)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТПростои.Ссылка КАК Ссылка,
	               |	КартаЗнанийТест.УровеньВладения КАК УровеньВладения,
	               |	КартаЗнанийТест.Вопрос.Компетенция.СистемаУчета КАК СистемаУчета
	               |ПОМЕСТИТЬ ВТУровниВладения
	               |ИЗ
	               |	ВТПростои КАК ВТПростои
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КартаЗнаний КАК КартаЗнанийТест
	               |		ПО ВТПростои.Ссылка = КартаЗнанийТест.Сотрудник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТПростои.Ссылка,
	               |	КартаЗнанийТест.Вопрос.Компетенция.СистемаУчета,
	               |	КартаЗнанийТест.УровеньВладения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КлиентыИспользуемыеСистемы.ИТСистема КАК ИТСистема
	               |ПОМЕСТИТЬ ВТКлиенты
	               |ИЗ
	               |	Справочник.Клиенты.ИспользуемыеСистемы КАК КлиентыИспользуемыеСистемы
	               |ГДЕ
	               |	КлиентыИспользуемыеСистемы.Ссылка = &Клиент
	               |	И КлиентыИспользуемыеСистемы.ИТСистема = &ИТСистема
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТКлиенты.ИТСистема КАК ИТСистемаЗаказчика,
	               |	ВТУровниВладения.Ссылка КАК Сотрудник,
	               |	ВТУровниВладения.УровеньВладения КАК УровеньВладения
	               |ПОМЕСТИТЬ КомпетенцииПодЗадачу
	               |ИЗ
	               |	ВТКлиенты КАК ВТКлиенты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТУровниВладения КАК ВТУровниВладения
	               |		ПО ВТКлиенты.ИТСистема = ВТУровниВладения.СистемаУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	КомпетенцииПодЗадачу.ИТСистемаЗаказчика КАК ИТСистемаЗаказчика,
	               |	КомпетенцииПодЗадачу.Сотрудник КАК Сотрудник,
	               |	КомпетенцииПодЗадачу.УровеньВладения КАК УровеньВладения
	               |ИЗ
	               |	КомпетенцииПодЗадачу КАК КомпетенцииПодЗадачу
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	УровеньВладения УБЫВ";
	
	
	Запрос.УстановитьПараметр("Клиент",Клиент);              
	СостояниеЗагруженностиПростой = Новый СписокЗначений;
	СостояниеЗагруженностиПростой.Добавить(Перечисления.СостояниеЗагруженности.ПустаяСсылка());
	СостояниеЗагруженностиПростой.добавить(Перечисления.СостояниеЗагруженности.Простой);
	Запрос.УстановитьПараметр("СостояниеЗагруженностиПростой",СостояниеЗагруженностиПростой);
	Запрос.УстановитьПараметр("ИТСистема",ИТСистема);
	Выбор = Запрос.Выполнить().Выбрать();
	
	Пока Выбор.Следующий() Цикл
		Возврат Выбор.Сотрудник;
	КонецЦикла;
КонецФункции

//Отправка в kafka			
Процедура kafka_send(ОбращениеСсылка) экспорт
	
	//Сериализация
	ГУИД = Строка(ОбращениеСсылка.УникальныйИдентификатор());	
	СериализованнаяСтрока = СериализоватьВJSON(ОбращениеСсылка);	   
	Попытка
		Результат = ПодключитьВнешнююКомпоненту("Обработка.РаботаСKafkaЧерезВК.Макет.librdkafka_win64" ,"librdkafka", ТипВнешнейКомпоненты.Native);
		глProducer = Новый("AddIn.librdkafka.KafkaProducer");	
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;      
	
    SetGlobalConf = глProducer.SetGlobalConf("queue.buffering.max.messages", "1000000");
	SetGlobalConf = глProducer.SetGlobalConf("socket.timeout.ms", "30000");
	SetGlobalConf = глProducer.SetGlobalConf("delivery.report.only.error", "false");

	SetTopicConf = глProducer.SetTopicConf("message.timeout.ms", "30000");
	SetTopicConf = глProducer.SetTopicConf("compression.codec", "lz4");
	SetTopicConf = глProducer.SetTopicConf("request.required.acks", "-1");
	
	Хост = Константы.ХостКафка.Получить();
	
	Initialize = глProducer.Initialize(Хост, "SD", -1);

	мДанныеНаЗапись = Новый Массив();
	мЗаголовки = Новый Массив();
	мЗаголовки.Добавить(Новый Структура("СсылкаНаДокумент", Строка(ОбращениеСсылка)));
	мДанныеНаЗапись.Добавить(Новый Структура("Key, Value, Headers", ГУИД, СериализованнаяСтрока, мЗаголовки));
    стрJSON =  СтруктуруВJSON(мДанныеНаЗапись);
	глProducer.SetJSONMessageList(стрJSON);

	булУспешно = глProducer.Produce();
	стрОтчетОДоставке = глProducer.GetJSONDeliveryReport();
	

КонецПроцедуры   

Функция СериализоватьВJSON(ОбращениеСсылка) Экспорт
    
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыJSON = Новый ПараметрыЗаписиJSON( ,,,,,Истина,Истина,Истина,Истина);

	ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
	 
	ОбъектОбращение = ОбращениеСсылка.ПолучитьОбъект();
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, ОбъектОбращение, НазначениеТипаXML.Явное);
	СериализованнаяСтрока = ЗаписьJSON.Закрыть();  
	
    Возврат СериализованнаяСтрока;
    
КонецФункции  

Функция СтруктуруВJSON(п_сткДанные)    Экспорт
	
	_ЗаписьJSON                = Новый ЗаписьJSON();
	_НастройкиСериализацииJSON = Новый НастройкиСериализацииJSON();
	
	_ЗаписьJSON.УстановитьСтроку();
	
	_НастройкиСериализацииJSON.ВариантЗаписиДаты      = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	_НастройкиСериализацииJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	Попытка
		ЗаписатьJSON(_ЗаписьJSON, п_сткДанные, _НастройкиСериализацииJSON);
		
		_сткРезультат = _ЗаписьJSON.Закрыть();
	Исключение
		Возврат ОписаниеОшибки();	
	КонецПопытки;
	
	Возврат _сткРезультат;   	
КонецФункции
